{
  "nav": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "contact": "Contact"
  },
  "home": {
    "title": "Hey, I'm Mateo 👋",
    "subtitle": "Web developer focused on creating modern and performant interfaces.",
    "viewProjects": "View Projects",
    "contact": "Contact Me",
    "selectedProjects": "Selected Projects",
    "portfolioDesc": "Personal portfolio built with React and Tailwind CSS.",
    "dashboardDesc": "Modern dashboard interface with analytics components.",
    "mobileDesc": "Cross-platform mobile app built with React Native.",
    "readMore": "Read more →"
  },
  
  "projects": {
    "title": "My Projects",
    "portfolioDesc": "Personal portfolio built with React and Tailwind.",
    "dashboardDesc": "Modern dashboard interface with analytics.",
    "mobileDesc": "Cross-platform mobile application.",
    "aqm": {
      "title": "AQM Device",
      "description": "Industrialization of an IoT air quality monitoring device (production management, financial analysis and optimization).",
      "button": "View project"
    },
    "aqmDesc": "Industrialization of an IoT air quality monitoring device including financial analysis and production optimization."

  },
  "about": {
    "title": "About Me",
    "description": "I am a developer passionate about building modern and performant interfaces.",
    "skillsTitle": "Skills",
    "goalTitle": "Goal",
    "goalText": "To build elegant and efficient digital products."
  },
  
  "portfolioProject": {
    "title": "Personal Portfolio",
    "subtitle": "A modern showcase website to present my projects and skills.",
    "overviewTitle": "Overview",
    "overviewText": "This portfolio was designed to present my projects, skills and experience in a clean and professional way.",
    "challengeTitle": "Challenge",
    "challengeText": "Create a minimal, responsive and multilingual interface while maintaining high performance.",
    "resultTitle": "Result",
    "resultText": "A fast, modern and scalable website ready for future projects and improvements."
  },
  "aqm": {
    "title": "AQM Device (Air Quality Monitoring)",
    "subtitle": "Industrialization of an IoT air quality monitoring device.",
    "contextTitle": "Context",
    "contextText": "As part of a group project (4 members), we worked on the production management of a connected device for the French start-up NOSE. The goal was to transform a prototype into an industrializable product.",
    "approachTitle": "Approach",
    "step1": "Design and validation of the device prototype.",
    "step2": "Definition of the assembly process and manufacturing steps.",
    "step3": "Complete financial analysis (materials, production, assembly costs).",
    "step4": "Proposed improvements to optimize the production line.",
    "step5": "Final report writing and presentation.",
    "learningTitle": "Skills Developed",
    "figcaption1":"Technical drawing of an exploded view of the device, created in Fusion 360.",
    "learningText": "This project gave me a global understanding of the IoT product lifecycle, from design to industrial production. I strengthened my skills in production management, financial analysis and teamwork."
  },
  "asservissement": {
    "title": "Interactive Toy with Control System",
    "subtitle": "Design of a mechatronic system integrating a rotating base and marble launcher.",
    "contextTitle": "Context",
    "contextText": "As part of a school project in a team of four, we worked on the design and development of an interactive toy. It consisted of a rotating base and a marble launcher, integrating mechanical, electronic components and a control system. The project's objective was to design a playful and functional device, combining power electronics and control systems. The system had to use a DC motor for rotation and a servomotor for shooting, all controlled by an Arduino board.",
    "figcaption1": "Wiring diagram of the device.",
    "approachTitle": "Approach",
    "step1": "Functional analysis: development of precise specifications defining needs, constraints and expected functionalities.",
    "step2": "Prototyping: creation of a prototype integrating the rotating base and progressive development of components (motor, servomotor, electromagnet).",
    "step3": "Command and control: Arduino programming to manage movements, with implementation of PID control to ensure precision.",
    "step4": "Testing and adjustments: conducting test series to verify reliability and adjust parameters, while considering safety and efficiency aspects.",
    "learningTitle": "Skills Developed",
    "learningText": "This project allowed me to put into practice my knowledge in electronics, embedded programming and control systems. I was able to deepen my understanding of PID loops and their practical application, while working on the integration of mechanical and electronic elements in a single system. This experience strengthened my skills in collaborative work, prototyping and development of automated systems."
  },
  "amplification": {
    "title": "Connected Audio Amplifier",
    "subtitle": "Design of an audio amplifier with energy optimization and SIGFOX IoT connectivity.",
    "contextTitle": "Context",
    "contextText": "As part of a school project in a team of four, we worked on the design and development of an audio amplifier integrating advanced optimization and connectivity features. The main objective was to develop an amplifier prototype combining energy efficiency and power gain, while ensuring mechanical robustness and ease of maintenance. A unique feature of this project was the integration of data transmission via the SIGFOX network, enabling the device to connect to an IoT network.",
    "figcaption1": "Schematic of a push-pull amplifier with transistors.",
    "approachTitle": "Approach",
    "step1": "Preliminary study: analysis of different types of amplifiers (passive and active) to determine the most suitable architecture.",
    "step2": "Simulation: design and validation of an initial prototype using software to anticipate circuit behavior.",
    "step3": "Complete prototype realization: integration of electronic and mechanical components to build a functional system.",
    "step4": "Demonstration: presentation of the final prototype and validation of its performance under real conditions.",
    "learningTitle": "Skills Developed",
    "learningText": "This project allowed me to develop skills in analog and digital electronics, particularly in signal amplification and filtering. I also gained better mastery of electronic circuit simulation tools and was able to experiment with integrating an IoT connectivity solution (SIGFOX) into an embedded system. Finally, this teamwork taught me to balance technical performance, robustness, and energy consumption constraints in electronic design."
  },
  "meteo": {
    "title": "Embedded Weather Station",
    "subtitle": "Environmental monitoring device for maritime context.",
    "contextTitle": "Context",
    "contextText": "In a team of four, we conducted a project on embedded systems aimed at designing an environmental monitoring device usable in a maritime context. The objective was to develop an embedded weather station that is both user-friendly for crew members and capable of performing complete measurement, monitoring, and recording functions for environmental data (temperature, humidity, pressure, etc.).",
    "figcaption1": "Schematic of the weather station operation.",
    "approachTitle": "Approach",
    "step1": "System analysis: definition of functional requirements, technical constraints, and usage conditions in an embedded environment.",
    "step2": "Software design: development of the program architecture to organize sensor management, data storage, and user interface.",
    "step3": "Prototyping: creation of a functional mockup integrating sensors and the embedded processing unit.",
    "step4": "Documentation: writing a complete technical document detailing the design, software and hardware architecture, as well as the chosen technological solutions.",
    "learningTitle": "Skills Developed",
    "learningText": "This project allowed me to deepen my skills in embedded systems, particularly in sensor management and data acquisition. I also learned to structure a project around a clear software architecture and to produce complete technical documentation, essential for reproducibility and maintenance. This collaborative work strengthened my ability to link user requirements, technical constraints, and concrete implementation."
  },
  "tourelle": {
    "title": "Facial Recognition Turret",
    "subtitle": "Motorized system integrating computer vision and facial recognition on Raspberry Pi.",
    "contextTitle": "Context",
    "contextText": "As part of my internship, carried out in a pair, we worked on the development of a motorized turret integrating a facial recognition system. This project combined electronics, mechanics, computer vision, and technical communication. The main objective was to design an imposing and functional turret, based on a Raspberry Pi and Python development, while ensuring ease of use. The project also had to be educational and accessible to a wide audience, through regular communication via weekly videos demonstrating progress, without compromising visual quality or technical clarity.",
    "figcaption1": "Screenshot of the facial recognition video feedback.",
    "figcaption2": "CAD of the firing system.",
    "approachTitle": "Approach",
    "step1": "Needs analysis: identification of technical, mechanical, and software constraints to ensure robustness and simplicity.",
    "step2": "System design: definition of the architecture (connection between Raspberry Pi, motors, and camera).",
    "step3": "3D modeling: design of mechanical parts necessary for turret support and movement.",
    "step4": "Manufacturing: 3D printing and assembly of various mechanical and electronic components.",
    "step5": "Software development: Python programming for motor management and facial recognition implementation.",
    "step6": "Testing and validation: performance evaluation, adjustments, and public demonstrations of functionality.",
    "learningTitle": "Skills Developed",
    "learningText": "This project allowed me to develop concrete skills in Python programming, particularly in computer vision aspects and motor control via Raspberry Pi. I also gained experience in 3D modeling and mechanical-electronic integration, while learning to effectively communicate technical results in a clear and accessible manner. Working in pairs strengthened my ability to collaborate, plan, and meet time constraints in a semi-professional context."
  },
   "robotcrabe": {
    "title": "Motorized Crab Robot",
    "subtitle": "Design of a quadruped robot controllable via wireless web interface.",
    "contextTitle": "Context",
    "contextText": "This personal project consisted of designing and building a motorized crab robot, integrating mechanical, electronic, and software aspects. The goal was to create an immersive experience combining 3D modeling, embedded electronics, and wireless connectivity. The objective was to develop a robot capable of coordinated leg movements, controllable via a mobile interface. The project combines mechanical design, embedded programming, and wireless connectivity, offering a complete integration of different engineering disciplines.",
    "figcaption1": "Photo of the assembled crab robot.",
    "approachTitle": "Approach",
    "step1": "3D Modeling: design of different parts of the crab to ensure functionality and mechanical robustness.",
    "step2": "Manufacturing: 3D printing of parts and preparation of electronic components.",
    "step3": "Assembly: mechanical assembly and integration of servomotors and ESP32 board.",
    "step4": "Programming: development of an HTML web interface to control leg movements and the embedded camera, via wireless connection.",
    "learningTitle": "Skills Developed",
    "learningText": "This project allowed me to develop cross-functional skills in mechanical design, 3D prototyping, embedded programming, and user interface development. I learned to coordinate different systems (mechanical, electronic, and software) to achieve a functional and interactive device, while exploring wireless connectivity for remote control."
  },
   "declencheur": {
    "title": "Film Camera Remote Trigger",
    "subtitle": "Remote triggering device for analog film cameras.",
    "contextTitle": "Context",
    "contextText": "As part of a project for a company specializing in analog photography development, I participated in the design and implementation of a remote trigger for analog cameras. The product had to be practical, portable, and easily usable by the public.",
    "objectivesTitle": "Device objectives",
    "objective1": "Trigger the camera remotely via remote control.",
    "objective2": "Offer multiple trigger modes (immediate or with 5-second timer).",
    "objective3": "Be portable, powered by rechargeable battery, and designed with a sober design.",
    "figcaption1": "Prototype of the analog camera trigger.",
    "approachTitle": "Approach",
    "step1": "Component selection: ESP32, servomotor, BMS, 18650 battery, 433 MHz receiver, and mechanical trigger adapted to analog cameras.",
    "step2": "Prototyping and design: creation of a functional prototype integrating mechanics, electronics, and programming.",
    "step3": "3D case: modeling and PLA printing to ensure robustness and ergonomics.",
    "step4": "Software development: ESP32 programming to manage different trigger modes and remote control signal reception.",
    "step5": "Testing and adjustments: validation of reliability, autonomy, and trigger precision.",
    "statusTitle": "Project Status",
    "statusText": "The first version of the prototype (V1) is completed and currently in testing phase.",
    "learningTitle": "Skills Developed",
    "learningText": "This project allowed me to develop skills in embedded systems, prototyping, electronics, and mechanical design, while taking into account constraints of portability, autonomy, and user ergonomics."
  },
   "decors": {
    "title": "Automated Stage Props",
    "subtitle": "Automated stage props system for theatrical production with rotating crane, traffic lights and motorized vehicles.",
    "contextTitle": "Context",
    "contextText": "As part of a project carried out for a show production company, I participated in the design and implementation of automated stage props. These props had to be able to perform various mechanical actions (rotation, movement, signaling) autonomously, while being easily controllable by an operator.",
    "objectivesTitle": "System objectives",
    "objective1": "Rotate a crane by a defined angle, then return to its initial position in a loop.",
    "objective2": "Control a traffic light alternating between red and green every x seconds.",
    "objective3": "Move miniature cars forward on stage.",
    "objective4": "The system had to be activated by a simple button, run on battery, and be reliable for rehearsals and performances.",
    "figcaption1": "Automated stage props for show.",
    "approachTitle": "Approach",
    "step1": "Analysis and component selection: use of an Arduino Uno, 2 stepper motor drivers, a BMS, a voltage booster, a switch, a servomotor, and 2 stepper motors.",
    "step2": "Prototyping: creation of functional prototypes to test mechanics, motors, and programming before the final version.",
    "step3": "Wiring and soldering: complete realization of connections between all electronic components to ensure reliable and safe operation.",
    "step4": "Mechanical design: 3D modeling and printing of motor supports and main enclosure, ensuring robustness and optimal integration.",
    "step5": "Software development: programming of motor movements and lights, with loop cycle management and button control.",
    "step6": "Testing and adjustments: validation of trajectories, timings, and battery power supply to ensure reliability in real conditions.",
    "learningTitle": "Skills Developed",
    "learningText": "This project allowed me to develop comprehensive skills in prototyping, embedded systems, Arduino programming, motorization, and electronic wiring. I also strengthened my abilities in mechanical design and electromechanical system integration, while respecting reliability and ergonomics constraints for stage use."
  },
  "contact": {
    "title": "Contact",
    "subtitle": "You can send me a message using this form.",
    "firstNameLabel": "First name",
    "lastNameLabel": "Last name",
    "emailLabel": "Email",
    "messageLabel": "Message",
    "firstNamePlaceholder": "e.g. Mateo",
    "lastNamePlaceholder": "e.g. Repulles",
    "emailPlaceholder": "e.g. mateo@email.com",
    "messagePlaceholder": "Write your message here...",
    "send": "Send",
    "sending": "Sending...",
    "success": "Message sent ✅",
    "error": "Error while sending ❌"
  }


}
