{
  "nav": {
    "home": "Accueil",
    "about": "À propos",
    "projects": "Projets",
    "contact": "Contact"
  },
  
    "home": {
    "title": "Salut, moi c'est Mateo 👋",
    "subtitle": "Étudiant ingénieur en systèmes embarqués et IoT basé à Paris. J'écris du firmware, je conçois des PCB et j'imprime mes boîtiers en 3D. Sur ce site, tu trouveras mes projets IoT, mes expériences professionnelles et tout ce qui tourne autour des microcontrôleurs et de l'électronique embarquée. Actuellement en recherche de stage à l'international !",
    "viewProjects": "Voir mes projets",
    "contact": "Me contacter",
    "aboutTitle": "À propos de moi",
    "aboutText": "Passionné par les systèmes embarqués, je combine développement firmware et conception hardware pour créer des solutions IoT complètes. De la validation de drones chez Aerommaper (filiale Thales) aux projets de fabrication additive intégrant l'électronique, j'aime transformer des idées en prototypes fonctionnels.",
    "aboutText2": "Avec une experience en STM32, ESP32, protocoles de communication (UART, SPI, I2C, MQTT) et systèmes temps réel, je cherche constamment à approfondir mes compétences techniques et à relever de nouveaux défis dans le domaine de l'embarqué.",
    "currentFocus": "Focus actuel",
    "education": "Formation",
    "availability": "Disponibilité",
    "availabilityText": "Ouvert aux stages internationaux",
    "selectedProjects": "Projets sélectionnés",
    "portfolioDesc": "Portfolio Web",
    "dashboardDesc": "Site portfolio moderne développé avec React et Tailwind CSS.",
    "readMore": "En savoir plus →"
  },
  "footer": {
    "quickLinks": "Liens rapides",
    "projects": "Projets",
    "about": "À propos",
    "contact": "Contact",
    "connect": "Me suivre",
    "rights": "Tous droits réservés.",
    "madeWith": "Créé avec"
  },
  "project": {
    "title": "Mes Projets",
    "subtitle": "Découvrez mes réalisations en systèmes embarqués, IoT et électronique",
    "viewDetails": "Voir les détails",

    "backToProjects": "Retour aux projets",
    "asservissement": {
      "title": "Jouet Interactif avec Système d'Asservissement",
      "intro": "Conception d'un système mécatronique intégrant une base rotative et un lanceur de billes. Projet combinant électronique de puissance, asservissement PID et programmation Arduino.",
      "objective": {
        "title": "Objectif",
        "text": "Concevoir un dispositif ludique et fonctionnel combinant électronique de puissance et systèmes d'asservissement"
      },
      "timeline": {
        "title": "Durée",
        "text": "Projet scolaire - 3 mois"
      },
      "team": {
        "title": "Équipe",
        "text": "Projet en équipe de 4 personnes"
      },
      "context": {
        "title": "Contexte du projet",
        "p1": "Dans le cadre d'un projet scolaire en équipe de quatre, nous avons travaillé sur la conception et le développement d'un jouet interactif. Il était constitué d'une base rotative et d'un lanceur de billes, intégrant des composants mécaniques, électroniques et un système d'asservissement.",
        "p2": "L'objectif du projet était de concevoir un dispositif ludique et fonctionnel, combinant électronique de puissance et systèmes d'asservissement. Le système devait utiliser un moteur à courant continu pour la rotation et un servomoteur pour le tir, le tout contrôlé par une carte Arduino."
      },
      "diagram": {
        "title": "Schéma électrique",
        "caption": "Schéma de câblage du dispositif"
      },
      "approach": {
        "title": "Démarche",
        "step1": {
          "title": "Analyse fonctionnelle",
          "text": "Élaboration d'un cahier des charges précis définissant besoins, contraintes et fonctionnalités attendues."
        },
        "step2": {
          "title": "Prototypage",
          "text": "Création d'un prototype intégrant la base rotative et développement progressif des composants (moteur, servomoteur, électroaimant)."
        },
        "step3": {
          "title": "Commande et contrôle",
          "text": "Programmation Arduino pour gérer les mouvements, avec implémentation d'un asservissement PID pour assurer la précision."
        },
        "step4": {
          "title": "Tests et ajustements",
          "text": "Conduite de séries de tests pour vérifier la fiabilité et ajuster les paramètres, en considérant les aspects de sécurité et d'efficacité."
        }
      },
      "features": {
        "title": "Fonctionnalités principales",
        "rotation": {
          "title": "Base rotative",
          "text": "Système de rotation précis contrôlé par moteur à courant continu avec asservissement"
        },
        "launcher": {
          "title": "Lanceur de billes",
          "text": "Mécanisme de tir actionné par servomoteur pour projection de projectiles"
        },
        "pid": {
          "title": "Asservissement PID",
          "text": "Contrôle précis des mouvements avec régulation proportionnelle-intégrale-dérivée"
        },
        "power": {
          "title": "Électronique de puissance",
          "text": "Gestion de l'alimentation et du contrôle des actionneurs haute puissance"
        }
      },
      "technical": {
        "title": "Stack technique",
        "hardware": "Hardware",
        "software": "Logiciel & Contrôle",
        "arduino": "Carte Arduino - Contrôle central du système",
        "dcMotor": "Moteur à courant continu pour la rotation",
        "servo": "Servomoteur pour le mécanisme de tir",
        "electromagnet": "Électroaimant pour manipulation des billes",
        "powerElectronics": "Circuits de puissance pour contrôle moteur",
        "programming": "Programmation Arduino (C/C++)",
        "pidControl": "Implémentation d'algorithme PID pour asservissement",
        "motorControl": "Contrôle PWM des moteurs",
        "specs": "Cahier des charges fonctionnel détaillé"
      },
      "pid": {
        "title": "Qu'est-ce que l'asservissement PID ?",
        "p1": "Un régulateur PID (Proportionnel-Intégral-Dérivé) est un système de contrôle permettant d'atteindre et maintenir une consigne avec précision. Dans notre projet, il assure la rotation précise de la base en corrigeant continuellement l'erreur entre la position souhaitée et la position réelle.",
        "proportional": "Correction proportionnelle à l'erreur actuelle",
        "integral": "Correction basée sur l'accumulation des erreurs passées",
        "derivative": "Anticipation basée sur la vitesse de changement de l'erreur"
      },
      "skills": {
        "title": "Compétences développées",
        "p1": "Ce projet m'a permis de mettre en pratique mes connaissances en électronique, programmation embarquée et systèmes d'asservissement.",
        "p2": "J'ai pu approfondir ma compréhension des boucles PID et leur application pratique, tout en travaillant sur l'intégration d'éléments mécaniques et électroniques dans un système unique.",
        "p3": "Cette expérience a renforcé mes compétences en travail collaboratif, prototypage et développement de systèmes automatisés.",
        "badge1": {
          "title": "Électronique embarquée",
          "text": "Arduino et électronique de puissance"
        },
        "badge2": {
          "title": "Asservissement PID",
          "text": "Contrôle précis et régulation"
        },
        "badge3": {
          "title": "Intégration",
          "text": "Mécanique, électronique et logiciel"
        }
      }
    },
    "amplification": {
      "title": "Amplificateur Audio Connecté",
      "intro": "Conception d'un amplificateur audio avec optimisation énergétique et connectivité IoT SIGFOX. Projet combinant électronique analogique, amplification, filtrage et transmission de données.",
      "objective": {
        "title": "Objectif",
        "text": "Développer un amplificateur audio alliant efficacité énergétique, gain en puissance et connectivité IoT"
      },
      "timeline": {
        "title": "Durée",
        "text": "Projet scolaire - 3 mois"
      },
      "team": {
        "title": "Équipe",
        "text": "Projet en équipe de 4 personnes"
      },
      "context": {
        "title": "Contexte du projet",
        "p1": "Dans le cadre d'un projet scolaire en équipe de quatre, nous avons travaillé sur la conception et la réalisation d'un amplificateur audio intégrant des fonctionnalités avancées d'optimisation et de connectivité.",
        "p2": "L'objectif principal était de développer un prototype d'amplificateur alliant efficacité énergétique et gain en puissance, tout en garantissant une robustesse mécanique et une facilité de maintenance. Une particularité de ce projet était d'intégrer une transmission de données via le réseau SIGFOX, permettant de connecter l'appareil à un réseau IoT."
      },
      "circuit": {
        "title": "Architecture électronique",
        "caption": "Schéma d'un push pull avec des transistors"
      },
      "approach": {
        "title": "Démarche",
        "step1": {
          "title": "Étude préliminaire",
          "text": "Analyse des différents types d'amplificateurs (passifs et actifs) afin de déterminer l'architecture la plus adaptée."
        },
        "step2": {
          "title": "Simulation",
          "text": "Conception et validation d'un premier prototype sur logiciel afin d'anticiper le comportement du circuit."
        },
        "step3": {
          "title": "Réalisation d'un prototype complet",
          "text": "Intégration des composants électroniques et mécaniques pour construire un système fonctionnel."
        },
        "step4": {
          "title": "Démonstration",
          "text": "Présentation du prototype final et validation de ses performances en conditions réelles."
        }
      },
      "features": {
        "title": "Fonctionnalités principales",
        "audio": {
          "title": "Amplification audio",
          "text": "Amplification et filtrage du signal audio avec gain en puissance optimisé"
        },
        "power": {
          "title": "Optimisation énergétique",
          "text": "Conception axée sur l'efficacité énergétique pour minimiser la consommation"
        },
        "iot": {
          "title": "Connectivité SIGFOX",
          "text": "Transmission de données via réseau IoT SIGFOX pour monitoring à distance"
        },
        "robust": {
          "title": "Robustesse mécanique",
          "text": "Structure robuste avec facilité de maintenance et de réparation"
        }
      },
      "technical": {
        "title": "Stack technique",
        "hardware": "Hardware",
        "design": "Conception & Simulation",
        "amplifier": "Circuit amplificateur push-pull à transistors",
        "filters": "Filtres actifs et passifs pour traitement du signal",
        "sigfox": "Module SIGFOX pour connectivité IoT",
        "power": "Gestion de l'alimentation et optimisation énergétique",
        "ltspice": "LTspice - Simulation de circuits électroniques",
        "pcb": "Conception de PCB pour intégration des composants",
        "analysis": "Analyse fréquentielle et temporelle des signaux",
        "optimization": "Optimisation du gain et de l'efficacité énergétique"
      },
      "types": {
        "title": "Types d'amplificateurs",
        "intro": "Notre étude préliminaire a porté sur l'analyse comparative des différentes architectures d'amplification pour sélectionner la solution optimale.",
        "passive": {
          "title": "Amplificateurs passifs",
          "text": "Utilisation de composants passifs (résistances, condensateurs) - Simplicité mais gain limité"
        },
        "active": {
          "title": "Amplificateurs actifs",
          "text": "Utilisation de transistors ou amplificateurs opérationnels - Gain élevé et meilleur contrôle"
        }
      },
      "skills": {
        "title": "Compétences développées",
        "p1": "Ce projet m'a permis de développer des compétences en électronique analogique et numérique, notamment sur l'amplification et le filtrage du signal.",
        "p2": "J'ai également acquis une meilleure maîtrise des outils de simulation de circuits électroniques et j'ai pu expérimenter l'intégration d'une solution de connectivité IoT (SIGFOX) dans un système embarqué.",
        "p3": "Enfin, ce travail en équipe m'a appris à concilier performance technique, robustesse et contraintes de consommation énergétique dans une conception électronique.",
        "badge1": {
          "title": "Électronique analogique",
          "text": "Amplification et filtrage du signal"
        },
        "badge2": {
          "title": "Simulation de circuits",
          "text": "LTspice et analyse de performances"
        },
        "badge3": {
          "title": "Connectivité IoT",
          "text": "Intégration SIGFOX et transmission"
        }
      }
    },
    "aqm": {
      "title": "Boîtier AQM (Air Quality Monitoring)",
      "intro": "Industrialisation d'un dispositif IoT de surveillance de la qualité de l'air pour la start-up française NOSE. Projet de gestion de production transformant un prototype en produit industrialisable.",
      "objective": {
        "title": "Objectif",
        "text": "Transformer un prototype conforme au cahier des charges en un produit industrialisable et rentable"
      },
      "timeline": {
        "title": "Durée",
        "text": "Projet scolaire - 4 mois"
      },
      "team": {
        "title": "Équipe",
        "text": "Projet en équipe de 4 personnes"
      },
      "context": {
        "title": "Contexte du projet",
        "p1": "Dans le cadre d'un projet de groupe (4 personnes), nous avons travaillé sur la gestion de production d'un objet connecté pour la start-up française NOSE.",
        "p2": "L'objectif était de transformer un prototype conforme au cahier des charges en un produit industrialisable, en considérant tous les aspects de la production : conception, fabrication, assemblage et coûts."
      },
      "drawing": {
        "title": "Conception technique",
        "caption": "Dessin technique d'une vue éclatée du dispositif, fait sur Fusion 360"
      },
      "approach": {
        "title": "Démarche",
        "step1": {
          "title": "Conception et validation du prototype",
          "text": "Validation du prototype du dispositif conforme au cahier des charges initial."
        },
        "step2": {
          "title": "Définition du procédé d'assemblage",
          "text": "Définition détaillée du procédé d'assemblage et des étapes de fabrication pour une production optimale."
        },
        "step3": {
          "title": "Bilan financier complet",
          "text": "Réalisation d'un bilan financier détaillé incluant coûts matières, production et assemblage."
        },
        "step4": {
          "title": "Optimisation de la production",
          "text": "Proposition d'améliorations de la ligne de production pour optimiser l'efficacité et réduire les coûts."
        },
        "step5": {
          "title": "Documentation et présentation",
          "text": "Rédaction et soutenance d'un dossier final détaillé présentant l'ensemble du projet."
        }
      },
      "aspects": {
        "title": "Aspects clés du projet",
        "design": {
          "title": "Conception mécanique",
          "text": "Modélisation 3D sur Fusion 360 avec vue éclatée et dessins techniques pour la production"
        },
        "production": {
          "title": "Gestion de production",
          "text": "Définition complète du procédé d'assemblage et planification des étapes de fabrication"
        },
        "financial": {
          "title": "Analyse financière",
          "text": "Calcul détaillé des coûts de production, matières premières et assemblage"
        },
        "optimization": {
          "title": "Optimisation",
          "text": "Propositions d'améliorations pour augmenter l'efficacité de la ligne de production"
        }
      },
      "technical": {
        "title": "Compétences techniques",
        "design": "Conception & CAO",
        "management": "Gestion & Analyse",
        "fusion360": "Fusion 360 - Modélisation 3D et dessins techniques",
        "technical": "Dessins techniques avec vues éclatées",
        "assembly": "Conception d'assemblages mécaniques",
        "productionManagement": "Gestion de production et planification",
        "costAnalysis": "Analyse financière et calcul de coûts",
        "processOptimization": "Optimisation des processus de fabrication",
        "documentation": "Documentation technique complète"
      },
      "industrialization": {
        "title": "Processus d'industrialisation",
        "p1": "Le projet nous a permis d'acquérir une vision complète du cycle de vie d'un produit IoT, de la conception initiale jusqu'à l'industrialisation à grande échelle.",
        "p2": "Nous avons particulièrement travaillé sur l'optimisation du rapport qualité-prix, en identifiant les opportunités de réduction des coûts sans compromettre les performances du dispositif.",
        "phase1": "Prototype",
        "phase1Text": "Validation du design et des fonctionnalités",
        "phase2": "Production",
        "phase2Text": "Définition des processus d'assemblage",
        "phase3": "Optimisation",
        "phase3Text": "Amélioration continue de l'efficacité"
      },
      "skills": {
        "title": "Compétences développées",
        "p1": "Ce projet m'a permis d'acquérir une vision globale du cycle de production d'un produit IoT, de la conception à l'industrialisation.",
        "p2": "J'ai renforcé mes compétences en gestion de production, analyse financière et travail en équipe, tout en développant une meilleure compréhension des enjeux de l'industrialisation d'objets connectés.",
        "badge1": {
          "title": "Industrialisation",
          "text": "Passage du prototype au produit"
        },
        "badge2": {
          "title": "Gestion financière",
          "text": "Analyse de coûts et rentabilité"
        },
        "badge3": {
          "title": "CAO Fusion 360",
          "text": "Modélisation et dessins techniques"
        }
      }
    },
    "tourelle": {
      "title": "Tourelle de Reconnaissance Faciale",
      "intro": "Système motorisé intégrant vision par ordinateur et reconnaissance faciale sur Raspberry Pi. Projet de stage combinant électronique, mécanique, développement Python et communication technique.",
      "objective": {
        "title": "Objectif",
        "text": "Concevoir une tourelle motorisée fonctionnelle avec système de reconnaissance faciale accessible et pédagogique"
      },
      "timeline": {
        "title": "Durée",
        "text": "Stage - Avril à Juillet 2024"
      },
      "team": {
        "title": "Équipe",
        "text": "Projet en binôme"
      },
      "context": {
        "title": "Contexte du projet",
        "p1": "Dans le cadre de mon stage, réalisé en binôme, nous avons travaillé sur le développement d'une tourelle motorisée intégrant un système de reconnaissance faciale. Ce projet combinait électronique, mécanique, vision par ordinateur et communication technique.",
        "p2": "L'objectif principal était de concevoir une tourelle imposante et fonctionnelle, reposant sur un Raspberry Pi et un développement en Python, tout en assurant une simplicité d'utilisation. Le projet devait également être pédagogique et accessible à un large public, grâce à une communication régulière via des vidéos hebdomadaires démontrant l'avancement, sans compromettre la qualité visuelle ni la clarté technique."
      },
      "demo": {
        "title": "Démonstration en action",
        "caption": "Capture d'écran du retour vidéo de la reconnaissance faciale"
      },
      "approach": {
        "title": "Démarche",
        "step1": {
          "title": "Analyse des besoins",
          "text": "Identification des contraintes techniques, mécaniques et logicielles pour assurer robustesse et simplicité."
        },
        "step2": {
          "title": "Conception du système",
          "text": "Définition de l'architecture (liaison entre Raspberry Pi, moteurs et caméra)."
        },
        "step3": {
          "title": "Modélisation 3D",
          "text": "Conception des pièces mécaniques nécessaires au support et au mouvement de la tourelle."
        },
        "step4": {
          "title": "Fabrication",
          "text": "Impression 3D et assemblage des différents composants mécaniques et électroniques."
        },
        "step5": {
          "title": "Développement logiciel",
          "text": "Programmation en Python pour la gestion des moteurs et l'implémentation de la reconnaissance faciale."
        },
        "step6": {
          "title": "Tests et validation",
          "text": "Évaluation des performances, ajustements et démonstrations publiques du fonctionnement."
        }
      },
      "cad": {
        "title": "Conception mécanique",
        "caption": "CAO du système de tir"
      },
      "features": {
        "title": "Fonctionnalités principales",
        "recognition": {
          "title": "Reconnaissance faciale",
          "text": "Détection et identification de visages en temps réel via algorithmes de vision par ordinateur"
        },
        "motor": {
          "title": "Système motorisé",
          "text": "Contrôle précis des mouvements pan/tilt pour suivi automatique des cibles"
        },
        "mechanical": {
          "title": "Conception mécanique",
          "text": "Structure imprimée en 3D robuste et fonctionnelle pour un système imposant"
        },
        "communication": {
          "title": "Communication technique",
          "text": "Vidéos hebdomadaires documentant l'avancement et le fonctionnement du projet"
        }
      },
      "technical": {
        "title": "Stack technique",
        "hardware": "Hardware",
        "software": "Logiciel & Design",
        "raspberry": "Raspberry Pi - Unité de traitement centrale",
        "camera": "Caméra compatible Raspberry Pi pour vision",
        "motors": "Servomoteurs pour mouvements pan/tilt",
        "print3d": "Pièces mécaniques imprimées en 3D",
        "python": "Python - Langage principal de développement",
        "opencv": "OpenCV - Vision par ordinateur et reconnaissance faciale",
        "motorControl": "Contrôle moteur via GPIO Raspberry Pi",
        "cad": "Logiciel CAO pour modélisation 3D des pièces"
      },
      "skills": {
        "title": "Compétences développées",
        "p1": "Ce projet m'a permis de développer des compétences concrètes en programmation Python, en particulier sur les aspects de vision par ordinateur et de contrôle moteur via Raspberry Pi.",
        "p2": "J'ai également acquis de l'expérience en modélisation 3D et en intégration mécanique-électronique, tout en apprenant à communiquer efficacement les résultats techniques de manière claire et accessible.",
        "p3": "Le travail en binôme a renforcé ma capacité à collaborer, planifier et respecter des contraintes de temps dans un cadre semi-professionnel.",
        "badge1": {
          "title": "Python & Vision",
          "text": "OpenCV et reconnaissance faciale"
        },
        "badge2": {
          "title": "Intégration",
          "text": "Mécanique, électronique et logiciel"
        },
        "badge3": {
          "title": "Communication",
          "text": "Vulgarisation technique accessible"
        }
      }
    },
    "meteo": {
      "title": "Station Météo Embarquée",
      "intro": "Dispositif de surveillance environnementale conçu pour un contexte maritime. Station météo embarquée capable d'assurer des fonctions complètes de mesure, surveillance et enregistrement des données environnementales.",
      "objective": {
        "title": "Objectif",
        "text": "Concevoir un dispositif de surveillance environnementale simple d'utilisation pour un équipage maritime"
      },
      "timeline": {
        "title": "Durée",
        "text": "Projet scolaire - 3 mois"
      },
      "team": {
        "title": "Équipe",
        "text": "Projet en équipe de 4 personnes"
      },
      "context": {
        "title": "Contexte du projet",
        "p1": "En équipe de quatre, nous avons mené un projet autour des systèmes embarqués visant à concevoir un dispositif de surveillance environnementale utilisable dans un contexte maritime.",
        "p2": "L'objectif était de développer une station météo embarquée, à la fois simple d'utilisation pour un membre d'équipage et capable d'assurer des fonctions complètes de mesure, surveillance et enregistrement des données environnementales (température, humidité, pression, etc.)."
      },
      "diagram": {
        "title": "Schéma du système",
        "caption": "Schéma du fonctionnement de la station météo"
      },
      "approach": {
        "title": "Démarche",
        "step1": {
          "title": "Analyse du système",
          "text": "Définition des besoins fonctionnels, contraintes techniques et conditions d'utilisation en milieu embarqué."
        },
        "step2": {
          "title": "Conception logicielle",
          "text": "Élaboration de l'architecture du programme pour organiser la gestion des capteurs, le stockage des données et l'interface utilisateur."
        },
        "step3": {
          "title": "Prototypage",
          "text": "Réalisation d'une maquette fonctionnelle intégrant les capteurs et la partie traitement embarqué."
        },
        "step4": {
          "title": "Documentation",
          "text": "Rédaction d'un dossier technique complet détaillant la conception, l'architecture logicielle et matérielle, ainsi que les choix technologiques retenus."
        }
      },
      "features": {
        "title": "Fonctionnalités principales",
        "sensors": {
          "title": "Mesures environnementales",
          "text": "Acquisition en temps réel de la température, humidité, pression atmosphérique et autres paramètres météorologiques"
        },
        "storage": {
          "title": "Enregistrement des données",
          "text": "Stockage local des mesures pour analyse et traçabilité des conditions environnementales"
        },
        "interface": {
          "title": "Interface utilisateur",
          "text": "Affichage simple et intuitif des données pour faciliter l'utilisation par l'équipage"
        },
        "marine": {
          "title": "Adaptation maritime",
          "text": "Conception robuste adaptée aux contraintes du milieu embarqué maritime"
        }
      },
      "technical": {
        "title": "Stack technique",
        "hardware": "Hardware",
        "software": "Logiciel",
        "mcu": "Microcontrôleur pour le traitement embarqué",
        "tempSensor": "Capteurs de température et humidité",
        "pressureSensor": "Capteur de pression atmosphérique",
        "display": "Écran LCD pour l'affichage des données",
        "embedded": "Programmation embarquée en C/C++",
        "protocols": "Protocoles de communication I2C/SPI pour les capteurs",
        "dataManagement": "Gestion et stockage des données environnementales",
        "architecture": "Architecture logicielle modulaire et maintenable"
      },
      "skills": {
        "title": "Compétences développées",
        "p1": "Ce projet m'a permis d'approfondir mes compétences en systèmes embarqués, notamment dans la gestion de capteurs et d'acquisitions de données.",
        "p2": "J'ai également appris à structurer un projet autour d'une architecture logicielle claire et à produire une documentation technique complète, indispensable pour la reproductibilité et la maintenance.",
        "p3": "Ce travail collaboratif a renforcé ma capacité à relier exigences utilisateur, contraintes techniques et réalisation concrète.",
        "badge1": {
          "title": "Systèmes embarqués",
          "text": "Gestion de capteurs et acquisition de données"
        },
        "badge2": {
          "title": "Architecture logicielle",
          "text": "Conception modulaire et structurée"
        },
        "badge3": {
          "title": "Documentation technique",
          "text": "Rédaction complète et détaillée"
        }
      }
    },
    "argentique": {
      "title": "Déclencheur Photo Argentique",
      "intro": "Dispositif de déclenchement à distance pour appareils photo argentiques. Projet professionnel combinant ESP32, communication 433 MHz, impression 3D et gestion de batterie.",
      "objective": {
        "title": "Objectif",
        "text": "Concevoir un déclencheur pratique, transportable et facilement utilisable par le grand public"
      },
      "timeline": {
        "title": "Statut",
        "text": "V1 terminée - En phase de test"
      },
      "type": {
        "title": "Type",
        "text": "Projet professionnel"
      },
      "context": {
        "title": "Contexte du projet",
        "p1": "Dans le cadre d'un projet pour une entreprise spécialisée dans le développement de photographie argentique, j'ai participé à la conception et à la réalisation d'un déclencheur à distance pour appareils photo argentiques.",
        "p2": "Le produit devait être pratique, transportable et facilement utilisable par le public, tout en intégrant des fonctionnalités avancées de déclenchement à distance via communication radio 433 MHz."
      },
      "goals": {
        "title": "Objectifs du dispositif",
        "trigger": {
          "title": "Déclenchement à distance",
          "text": "Déclencher l'appareil photo à distance via télécommande radio 433 MHz"
        },
        "modes": {
          "title": "Modes de déclenchement",
          "text": "Déclenchement immédiat ou avec retardateur de 5 secondes selon les besoins"
        },
        "portable": {
          "title": "Transportable & autonome",
          "text": "Alimenté par batterie 18650 rechargeable avec design sobre et ergonomique"
        }
      },
      "prototype": {
        "title": "Prototype V1",
        "caption": "Prototype du déclencheur photo argentique"
      },
      "approach": {
        "title": "Démarche",
        "step1": {
          "title": "Choix des composants",
          "text": "Sélection des composants : ESP32, servomoteur, BMS, batterie 18650, récepteur 433 MHz et déclencheur mécanique adapté aux appareils argentiques."
        },
        "step2": {
          "title": "Prototypage et conception",
          "text": "Réalisation d'un prototype fonctionnel, intégrant la mécanique, l'électronique et la programmation."
        },
        "step3": {
          "title": "Boîtier 3D",
          "text": "Modélisation et impression en PLA pour assurer robustesse et ergonomie du produit final."
        },
        "step4": {
          "title": "Développement logiciel",
          "text": "Programmation de l'ESP32 pour gérer les différents modes de déclenchement et la réception des signaux de télécommande."
        },
        "step5": {
          "title": "Tests et ajustements",
          "text": "Validation de la fiabilité, autonomie et précision du déclenchement en conditions réelles."
        }
      },
      "status": {
        "title": "État du projet",
        "badge": "V1 - En phase de test",
        "text": "La première version du prototype (V1) est terminée et actuellement en phase de test. Les résultats préliminaires sont encourageants en termes de fiabilité du déclenchement et d'autonomie de la batterie. Des ajustements sont en cours pour optimiser la précision et la portée de la communication radio."
      },
      "technical": {
        "title": "Stack technique",
        "hardware": "Hardware",
        "software": "Logiciel & Conception",
        "esp32": "ESP32 - Microcontrôleur principal",
        "servo": "Servomoteur - Mécanisme de déclenchement",
        "radio": "Récepteur 433 MHz - Communication sans fil",
        "battery": "Batterie 18650 - Alimentation rechargeable",
        "bms": "BMS - Gestion et protection de la batterie",
        "programming": "Programmation C++ sur ESP32",
        "modes": "Gestion des modes de déclenchement (immédiat / 5s)",
        "signal": "Réception et décodage signaux radio 433 MHz",
        "cad": "Modélisation 3D boîtier PLA sur Fusion 360"
      },
      "skills": {
        "title": "Compétences développées",
        "p1": "Ce projet m'a permis de développer des compétences en systèmes embarqués, prototypage, électronique et conception mécanique, tout en prenant en compte les contraintes de transportabilité, autonomie et ergonomie utilisateur.",
        "badge1": {
          "title": "Communication radio",
          "text": "Transmission 433 MHz et réception de signaux"
        },
        "badge2": {
          "title": "Prototypage 3D",
          "text": "Conception et impression boîtier PLA"
        },
        "badge3": {
          "title": "Gestion batterie",
          "text": "BMS, 18650 et optimisation autonomie"
        }
      }
    },
    "decors": {
      "title": "Décors Automatisés de Spectacle",
      "intro": "Système automatisé de décors pour production théâtrale avec grue rotative, feux de signalisation et véhicules motorisés. Projet professionnel combinant Arduino, moteurs pas à pas, impression 3D et automatisation.",
      "objective": {
        "title": "Objectif",
        "text": "Concevoir des décors autonomes et fiables pour répétitions et représentations, contrôlables par un simple bouton"
      },
      "timeline": {
        "title": "Durée",
        "text": "Projet professionnel - Livré en production"
      },
      "type": {
        "title": "Type",
        "text": "Projet professionnel"
      },
      "context": {
        "title": "Contexte du projet",
        "p1": "Dans le cadre d'un projet réalisé pour une entreprise de production de spectacles, j'ai participé à la conception et à la réalisation de décors automatisés.",
        "p2": "Ces décors devaient pouvoir effectuer différentes actions mécaniques (rotation, déplacement, signalisation) de manière autonome, tout en étant facilement contrôlables par un opérateur via un simple bouton, fonctionnant sur batterie."
      },
      "goals": {
        "title": "Objectifs du système",
        "crane": {
          "title": "Grue rotative",
          "text": "Faire tourner une grue d'un angle défini, puis revenir à sa position initiale en boucle automatique"
        },
        "lights": {
          "title": "Feux de signalisation",
          "text": "Contrôler un feu alternant entre rouge et vert toutes les x secondes de manière autonome"
        },
        "cars": {
          "title": "Véhicules motorisés",
          "text": "Faire avancer des voitures miniatures sur scène de façon synchronisée"
        },
        "control": {
          "title": "Contrôle simplifié",
          "text": "Tout actionné par un simple bouton, fonctionnant sur batterie, fiable pour répétitions et représentations"
        }
      },
      "scene": {
        "title": "Vue du décor",
        "caption": "Décors automatisés pour spectacle"
      },
      "approach": {
        "title": "Démarche",
        "step1": {
          "title": "Analyse et choix des composants",
          "text": "Utilisation d'une Arduino Uno, de 2 drivers de moteur pas à pas, d'un BMS, d'un élévateur de tension, d'un interrupteur, d'un servomoteur et de 2 moteurs pas à pas."
        },
        "step2": {
          "title": "Prototypage",
          "text": "Réalisation de prototypes fonctionnels pour tester la mécanique, les moteurs et la programmation avant la version finale."
        },
        "step3": {
          "title": "Câblage et soudure",
          "text": "Réalisation complète des connexions entre tous les composants électroniques pour assurer un fonctionnement fiable et sécurisé."
        },
        "step4": {
          "title": "Conception mécanique",
          "text": "Modélisation et impression 3D de supports pour moteurs et du boîtier principal, garantissant robustesse et intégration optimale."
        },
        "step5": {
          "title": "Développement logiciel",
          "text": "Programmation des mouvements des moteurs et des feux, avec gestion des cycles en boucle et contrôle via bouton."
        },
        "step6": {
          "title": "Tests et ajustements",
          "text": "Validation des trajectoires, des timings et de l'alimentation sur batterie pour garantir la fiabilité en conditions réelles."
        }
      },
      "technical": {
        "title": "Stack technique",
        "hardware": "Hardware",
        "software": "Logiciel & Conception",
        "arduino": "Arduino Uno - Contrôleur principal",
        "steppers": "2 moteurs pas à pas pour grue et véhicules",
        "drivers": "2 drivers de moteur pas à pas",
        "servo": "Servomoteur pour mécanisme de signalisation",
        "power": "BMS + élévateur de tension + batterie",
        "programming": "Programmation Arduino C/C++",
        "cycles": "Gestion des cycles en boucle automatique",
        "button": "Contrôle via interrupteur unique",
        "cad": "Modélisation 3D supports et boîtier"
      },
      "constraints": {
        "title": "Contraintes scéniques",
        "intro": "Le contexte d'utilisation scénique impose des contraintes particulièrement strictes. Le système doit fonctionner parfaitement à chaque représentation sans intervention technique, ce qui impose des exigences élevées en termes de fiabilité et de simplicité d'utilisation.",
        "reliability": {
          "title": "Fiabilité absolue",
          "text": "Zéro panne tolérée pendant les représentations"
        },
        "battery": {
          "title": "Autonomie batterie",
          "text": "Fonctionnement sans fil pendant toute la durée du spectacle"
        },
        "simplicity": {
          "title": "Simplicité d'usage",
          "text": "Un seul bouton pour tout contrôler sans formation technique"
        }
      },
      "skills": {
        "title": "Compétences développées",
        "p1": "Ce projet m'a permis de développer des compétences complètes en prototypage, systèmes embarqués, programmation Arduino, motorisation et câblage électronique.",
        "p2": "J'ai également renforcé mes capacités en conception mécanique et intégration de systèmes électromécaniques, tout en respectant les contraintes de fiabilité et d'ergonomie pour un usage scénique.",
        "badge1": {
          "title": "Automatisation",
          "text": "Moteurs pas à pas et cycles en boucle"
        },
        "badge2": {
          "title": "Câblage électronique",
          "text": "Intégration complète et soudure"
        },
        "badge3": {
          "title": "Contraintes scéniques",
          "text": "Fiabilité et ergonomie en production"
        }
      }
    },
    "crabe": {
      "title": "Robot Crabe Motorisé",
      "intro": "Conception d'un robot quadrupède contrôlable via interface web sans fil. Projet personnel combinant modélisation 3D, électronique embarquée ESP32 et développement web.",
      "objective": {
        "title": "Objectif",
        "text": "Créer un robot quadrupède fonctionnel avec mouvements coordonnés et contrôle sans fil via interface web"
      },
      "timeline": {
        "title": "Durée",
        "text": "Projet personnel - 2 mois"
      },
      "type": {
        "title": "Type",
        "text": "Projet personnel"
      },
      "context": {
        "title": "Contexte du projet",
        "p1": "Ce projet personnel consistait à concevoir et réaliser un robot crabe motorisé, intégrant à la fois des aspects mécaniques, électroniques et logiciels. L'objectif était de créer une expérience immersive mêlant modélisation 3D, électronique embarquée et connectivité sans fil.",
        "p2": "L'objectif était de développer un robot capable de mouvements coordonnés des pattes, contrôlables via une interface mobile. Le projet combine la conception mécanique, la programmation embarquée et la connectivité sans fil, offrant une intégration complète de différentes disciplines de l'ingénierie."
      },
      "assembled": {
        "title": "Robot assemblé",
        "caption": "Photo du robot crabe assemblé"
      },
      "approach": {
        "title": "Démarche",
        "step1": {
          "title": "Modélisation 3D",
          "text": "Conception des différentes parties du crabe pour assurer la fonctionnalité et la robustesse mécanique."
        },
        "step2": {
          "title": "Fabrication",
          "text": "Impression des pièces en 3D et préparation des composants électroniques."
        },
        "step3": {
          "title": "Assemblage",
          "text": "Montage mécanique et intégration des servomoteurs et de la carte ESP32."
        },
        "step4": {
          "title": "Programmation",
          "text": "Développement d'une interface web en HTML permettant de contrôler les mouvements des pattes et la caméra embarquée, via une connexion sans fil."
        }
      },
      "features": {
        "title": "Fonctionnalités principales",
        "quadruped": {
          "title": "Robot quadrupède",
          "text": "Quatre pattes motorisées avec mouvements coordonnés pour déplacements réalistes"
        },
        "web": {
          "title": "Interface web",
          "text": "Contrôle à distance via interface HTML accessible depuis mobile ou ordinateur"
        },
        "camera": {
          "title": "Caméra embarquée",
          "text": "Caméra contrôlable à distance pour vision en direct depuis l'interface"
        },
        "print3d": {
          "title": "Structure imprimée 3D",
          "text": "Corps et composants mécaniques entièrement conçus et imprimés en 3D"
        }
      },
      "technical": {
        "title": "Stack technique",
        "hardware": "Hardware",
        "software": "Logiciel & Interface",
        "esp32": "ESP32 - Microcontrôleur avec WiFi intégré",
        "servos": "Servomoteurs pour contrôle des pattes",
        "camera": "Module caméra pour vision embarquée",
        "printed": "Pièces mécaniques imprimées en 3D",
        "programming": "Programmation C++ pour ESP32",
        "webInterface": "Interface web HTML/CSS/JavaScript",
        "wifi": "Communication WiFi pour contrôle sans fil",
        "cad": "Modélisation 3D pour conception mécanique"
      },
      "integration": {
        "title": "Intégration multidisciplinaire",
        "p1": "Ce projet illustre l'intégration complète de trois disciplines majeures de l'ingénierie : la mécanique, l'électronique et le logiciel. Chaque système devait fonctionner en harmonie pour obtenir un robot fonctionnel et réactif.",
        "meca": {
          "title": "Mécanique",
          "text": "Conception et impression 3D de la structure"
        },
        "elec": {
          "title": "Électronique",
          "text": "ESP32, servomoteurs et caméra"
        },
        "soft": {
          "title": "Logiciel",
          "text": "Firmware embarqué et interface web"
        }
      },
      "skills": {
        "title": "Compétences développées",
        "p1": "Ce projet m'a permis de développer des compétences transversales en conception mécanique, prototypage 3D, programmation embarquée et développement d'interface utilisateur.",
        "p2": "J'ai appris à coordonner différents systèmes (mécanique, électronique et logiciel) pour obtenir un dispositif fonctionnel et interactif, tout en explorant la connectivité sans fil pour le contrôle à distance.",
        "badge1": {
          "title": "Robotique",
          "text": "Conception et contrôle de robot"
        },
        "badge2": {
          "title": "ESP32 & WiFi",
          "text": "Connectivité sans fil et interface web"
        },
        "badge3": {
          "title": "Intégration complète",
          "text": "Mécanique, électronique et logiciel"
        }
      }
    },
    "portfolio": {
      "title": "Portfolio Website",
      "intro": "Site web portfolio moderne et multilingue présentant mes projets, compétences et expériences en systèmes embarqués. Développé avec React et Tailwind CSS pour offrir une expérience utilisateur fluide et responsive.",
      "objective": {
        "title": "Objectif",
        "text": "Créer un portfolio professionnel pour présenter mes projets et faciliter les opportunités de stage à l'international"
      },
      "timeline": {
        "title": "Durée",
        "text": "Février 2025 (en cours)"
      },
      "role": {
        "title": "Rôle",
        "text": "Design, Développement Frontend, Déploiement"
      },
      "context": {
        "title": "Contexte du projet",
        "p1": "En tant qu'étudiant ingénieur en systèmes embarqués recherchant des opportunités de stage à l'international, j'avais besoin d'une plateforme pour présenter efficacement mes compétences techniques et mes réalisations.",
        "p2": "L'objectif était de créer un site moderne, multilingue (français, anglais, espagnol) et facilement maintenable qui reflète mon expertise technique tout en offrant une expérience utilisateur optimale.",
        "p3": "J'ai choisi React pour sa flexibilité et ses performances, combiné à Tailwind CSS pour un design moderne et responsive, et i18next pour la gestion multilingue."
      },
      "features": {
        "title": "Fonctionnalités principales",
        "multilingual": {
          "title": "Support multilingue",
          "text": "Interface disponible en français, anglais et espagnol avec changement de langue dynamique"
        },
        "responsive": {
          "title": "Design responsive",
          "text": "Adaptation parfaite à tous les écrans (mobile, tablette, desktop)"
        },
        "design": {
          "title": "Interface moderne",
          "text": "Design épuré et professionnel avec animations fluides et transitions"
        },
        "navigation": {
          "title": "Navigation intuitive",
          "text": "Structure claire avec routing côté client pour une expérience sans rechargement"
        }
      },
      "technical": {
        "title": "Détails techniques",
        "frontend": "Frontend",
        "features": "Fonctionnalités",
        "reactDesc": "Framework JavaScript pour une interface dynamique et performante",
        "routerDesc": "Navigation côté client pour une expérience SPA fluide",
        "tailwindDesc": "Framework CSS utility-first pour un design rapide et cohérent",
        "i18nDesc": "Gestion de la traduction et internationalisation multilingue",
        "responsiveDesc": "Adaptation mobile-first avec breakpoints optimisés",
        "componentDesc": "Organisation modulaire et réutilisable du code"
      },
      "challenges": {
        "title": "Défis & Solutions",
        "solution": "Solution",
        "challenge1": {
          "title": "Gestion du multilingue",
          "problem": "Mise en place d'un système de traduction efficace couvrant toutes les sections du site avec changement de langue instantané.",
          "solution": "Implémentation de react-i18next avec fichiers JSON séparés par langue, permettant un changement de langue sans rechargement et une maintenance facile des traductions."
        },
        "challenge2": {
          "title": "Design responsive cohérent",
          "problem": "Assurer une expérience visuelle optimale sur tous les types d'écrans tout en maintenant la cohérence du design.",
          "solution": "Utilisation de Tailwind CSS avec approche mobile-first et système de breakpoints personnalisés, testés sur différents appareils."
        }
      },
      "results": {
        "title": "Résultats",
        "p1": "Le portfolio offre une expérience utilisateur moderne et professionnelle, facilitant la présentation de mes compétences techniques et de mes projets aux recruteurs internationaux.",
        "p2": "La structure modulaire et le code bien organisé permettent d'ajouter facilement de nouveaux projets et de maintenir le site à jour avec mes expériences futures.",
        "languages": "Langues supportées",
        "responsive": "Responsive",
        "performance": "Performance optimale"
      }
    }
  },
  "about": {
    "title": "À propos",
    "intro": "Étudiant ingénieur passionné par les systèmes embarqués, l'IoT et l'électronique. Découvrez mon parcours, mes compétences et mes expériences.",
    "whoAmI": "Qui suis-je ?",
    "bio1": "Je suis Matéo Repulles, étudiant en Master Systèmes Embarqués & IoT à l'EFREI après avoir effectué ma classe préparatoire et ma L3 au CESI. Passionné par l'électronique et le développement firmware depuis plusieurs années, j'ai eu l'opportunité de travailler sur des projets variés allant de la validation de drones à la conception de systèmes électroniques intégrant la fabrication additive.",
    "bio2": "Mon approche combine une solide formation théorique avec une expérience pratique concrète. Que ce soit pour développer un firmware sur STM32, concevoir un PCB sur KiCad, ou débugger un système temps réel, j'aime relever des défis techniques et apprendre de nouvelles technologies.",
    "bio3": "Au-delà de mes études et expériences professionnelles, je suis également impliqué dans la communauté maker, membre du board MakerCesi, et participant aux WorldSkills en fabrication additive. Mes hobbies incluent la guitare, la photographie, l'impression 3D et les drones FPV.",
    "experience": "Expériences professionnelles",
    "exp1": {
      "title": "Technicien",
      "company": "Aerommaper (filiale Thales)",
      "date": "Jan 2025 - Avr 2025",
      "task1": "Validation des processus de production pour drones et équipements au sol",
      "task2": "Assistance au développement firmware, tests hardware et debugging"
    },
    "exp2": {
      "title": "Auto-entrepreneur",
      "company": "Urban Custom Print",
      "date": "Août 2024 - Présent",
      "task1": "Services d'impression et de design à la demande",
      "task2": "Support technique en collaboration avec une entreprise partenaire",
      "task3": "Gestion des factures, devis et communications clients"
    },
    "exp3": {
      "title": "Technicien",
      "company": "La Nouvelle École",
      "date": "Avr 2024 - Juil 2024",
      "task1": "Conception et développement de projets basés sur la fabrication additive intégrant l'électronique",
      "task2": "Rédaction de descriptions techniques détaillées et documentation de projets",
      "task3": "Supervision de l'espace technique et service client"
    },
    "skills": "Compétences techniques",
    "hardware": "Hardware",
    "programming": "Programmation",
    "protocols": "Protocoles de communication",
    "tools": "Outils & Logiciels",
    "systems": "Systèmes d'exploitation",
    "network": "Réseaux & Sécurité",
    "education": "Formation",
    "edu1": {
      "degree": "Master en Systèmes Embarqués & IoT",
      "focus": "Systèmes temps réel, Communications numériques, ARM/Cortex, Logiciel embarqué, VHDL, MATLAB"
    },
    "edu2": {
      "degree": "Cycle préparatoire (Années 1-2 / L1-L2) • Cycle ingénieur (Année 3 / L3)"
    }
  },
  "portfolioProject": {
    "title": "Portfolio Personnel",
    "subtitle": "Un site vitrine moderne pour présenter mes projets et compétences.",
    "overviewTitle": "Vue d'ensemble",
    "overviewText": "Ce portfolio a été conçu pour présenter mes projets, mes compétences et mon parcours de manière claire et professionnelle.",
    "challengeTitle": "Challenge",
    "challengeText": "Créer une interface minimaliste, responsive et multilingue tout en gardant de bonnes performances.",
    "resultTitle": "Résultat",
    "resultText": "Un site rapide, moderne et évolutif, prêt à accueillir de nouveaux projets et fonctionnalités."
  },
  "aqm": {
    "title": "Boîtier AQM (Air Quality Monitoring)",
    "subtitle": "Industrialisation d’un dispositif IoT de surveillance de la qualité de l’air.",
    "contextTitle": "Contexte",
    "contextText": "Dans le cadre d’un projet de groupe (4 personnes), nous avons travaillé sur la gestion de production d’un objet connecté pour la start-up française NOSE. L’objectif était de transformer un prototype conforme au cahier des charges en un produit industrialisable.",
    "approachTitle": "Démarche",
    "step1": "Conception et validation du prototype du dispositif.",
    "step2": "Définition du procédé d’assemblage et des étapes de fabrication.",
    "step3": "Réalisation d’un bilan financier complet (coûts matières, production, assemblage).",
    "step4": "Proposition d’améliorations de la ligne de production pour optimiser l’efficacité.",
    "step5": "Rédaction et soutenance d’un dossier final détaillé.",
    "learningTitle": "Compétences développées",
    "figcaption1":"Dessin technique d’une vue éclaté du dispositif, fait sur FUSION 360",
    "learningText": "Ce projet m’a permis d’acquérir une vision globale du cycle de production d’un produit IoT, de la conception à l’industrialisation. J’ai renforcé mes compétences en gestion de production, analyse financière et travail en équipe."
  },
  "asservissement": {
    "title": "Jouet Interactif avec Asservissement",
    "subtitle": "Conception d'un système mécatronique intégrant base tournante et lanceur de billes.",
    "contextTitle": "Contexte",
    "contextText": "Dans le cadre d'un projet scolaire en équipe de quatre, nous avons travaillé sur la conception et le développement d'un jouet interactif. Celui-ci était composé d'une base tournante et d'un lanceur de billes, intégrant à la fois des composants mécaniques, électroniques et un système de commande. L'objectif du projet était de concevoir un dispositif ludique et fonctionnel, en associant l'électronique de puissance et l'asservissement. Le système devait utiliser un moteur à courant continu pour la rotation et un servomoteur pour le tir, le tout piloté par une carte Arduino.",
    "figcaption1": "Schéma du câblage du dispositif.",
    "approachTitle": "Démarche",
    "step1": "Analyse fonctionnelle : élaboration d'un cahier des charges précis définissant les besoins, contraintes et fonctionnalités attendues.",
    "step2": "Prototypage : réalisation d'un prototype intégrant la base tournante et développement progressif des composants (moteur, servomoteur, électroaimant).",
    "step3": "Commande et contrôle : programmation de l'Arduino pour assurer la gestion des mouvements, avec mise en place d'un asservissement PID pour garantir la précision.",
    "step4": "Tests et ajustements : réalisation de séries de tests pour vérifier la fiabilité et ajuster les paramètres, tout en prenant en compte les aspects de sécurité et d'efficacité.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis de mettre en pratique mes connaissances en électronique, programmation embarquée et asservissement. J'ai pu approfondir la compréhension des boucles PID et leur application concrète, tout en travaillant sur l'intégration d'éléments mécaniques et électroniques dans un même système. Cette expérience a renforcé mes compétences en travail collaboratif, prototypage et mise au point de systèmes automatisés."
  },
   "amplification": {
    "title": "Amplificateur Audio Connecté",
    "subtitle": "Conception d'un amplificateur audio avec optimisation énergétique et connectivité IoT SIGFOX.",
    "contextTitle": "Contexte",
    "contextText": "Dans le cadre d'un projet scolaire en équipe de quatre, nous avons travaillé sur la conception et la réalisation d'un amplificateur audio intégrant des fonctionnalités avancées d'optimisation et de connectivité. L'objectif principal était de développer un prototype d'amplificateur alliant efficacité énergétique et gain en puissance, tout en garantissant une robustesse mécanique et une facilité de maintenance. Une particularité de ce projet était d'intégrer une transmission de données via le réseau SIGFOX, permettant de connecter l'appareil à un réseau IoT.",
    "figcaption1": "Schéma d'un push pull avec des transistors.",
    "approachTitle": "Démarche",
    "step1": "Étude préliminaire : analyse des différents types d'amplificateurs (passifs et actifs) afin de déterminer l'architecture la plus adaptée.",
    "step2": "Simulation : conception et validation d'un premier prototype sur logiciel afin d'anticiper le comportement du circuit.",
    "step3": "Réalisation d'un prototype complet : intégration des composants électroniques et mécaniques pour construire un système fonctionnel.",
    "step4": "Démonstration : présentation du prototype final et validation de ses performances en conditions réelles.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis de développer des compétences en électronique analogique et numérique, notamment sur l'amplification et le filtrage du signal. J'ai également acquis une meilleure maîtrise des outils de simulation de circuits électroniques et j'ai pu expérimenter l'intégration d'une solution de connectivité IoT (SIGFOX) dans un système embarqué. Enfin, ce travail en équipe m'a appris à concilier performance technique, robustesse et contraintes de consommation énergétique dans une conception électronique."
  },
  "meteo": {
    "title": "Station Météo Embarquée",
    "subtitle": "Dispositif de surveillance environnementale pour contexte maritime.",
    "contextTitle": "Contexte",
    "contextText": "En équipe de quatre, nous avons mené un projet autour des systèmes embarqués visant à concevoir un dispositif de surveillance environnementale utilisable dans un contexte maritime. L'objectif était de développer une station météo embarquée, à la fois simple d'utilisation pour un membre d'équipage et capable d'assurer des fonctions complètes de mesure, surveillance et enregistrement des données environnementales (température, humidité, pression, etc.).",
    "figcaption1": "Schéma du fonctionnement de la station météo.",
    "approachTitle": "Démarche",
    "step1": "Analyse du système : définition des besoins fonctionnels, contraintes techniques et conditions d'utilisation en milieu embarqué.",
    "step2": "Conception logicielle : élaboration de l'architecture du programme pour organiser la gestion des capteurs, le stockage des données et l'interface utilisateur.",
    "step3": "Prototypage : réalisation d'une maquette fonctionnelle intégrant les capteurs et la partie traitement embarqué.",
    "step4": "Documentation : rédaction d'un dossier technique complet détaillant la conception, l'architecture logicielle et matérielle, ainsi que les choix technologiques retenus.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis d'approfondir mes compétences en systèmes embarqués, notamment dans la gestion de capteurs et d'acquisitions de données. J'ai également appris à structurer un projet autour d'une architecture logicielle claire et à produire une documentation technique complète, indispensable pour la reproductibilité et la maintenance. Ce travail collaboratif a renforcé ma capacité à relier exigences utilisateur, contraintes techniques et réalisation concrète."
  },
  "tourelle": {
    "title": "Tourelle de Reconnaissance Faciale",
    "subtitle": "Système motorisé intégrant vision par ordinateur et reconnaissance faciale sur Raspberry Pi.",
    "contextTitle": "Contexte",
    "contextText": "Dans le cadre de mon stage, réalisé en binôme, nous avons travaillé sur le développement d'une tourelle motorisée intégrant un système de reconnaissance faciale. Ce projet combinait électronique, mécanique, vision par ordinateur et communication technique. L'objectif principal était de concevoir une tourelle imposante et fonctionnelle, reposant sur un Raspberry Pi et un développement en Python, tout en assurant une simplicité d'utilisation. Le projet devait également être pédagogique et accessible à un large public, grâce à une communication régulière via des vidéos hebdomadaires démontrant l'avancement, sans compromettre la qualité visuelle ni la clarté technique.",
    "figcaption1": "Capture d'écran du retour vidéo de la reconnaissance faciale.",
    "figcaption2": "CAO du système de tir.",
    "approachTitle": "Démarche",
    "step1": "Analyse des besoins : identification des contraintes techniques, mécaniques et logicielles pour assurer robustesse et simplicité.",
    "step2": "Conception du système : définition de l'architecture (liaison entre Raspberry Pi, moteurs et caméra).",
    "step3": "Modélisation 3D : conception des pièces mécaniques nécessaires au support et au mouvement de la tourelle.",
    "step4": "Fabrication : impression 3D et assemblage des différents composants mécaniques et électroniques.",
    "step5": "Développement logiciel : programmation en Python pour la gestion des moteurs et l'implémentation de la reconnaissance faciale.",
    "step6": "Tests et validation : évaluation des performances, ajustements et démonstrations publiques du fonctionnement.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis de développer des compétences concrètes en programmation Python, en particulier sur les aspects de vision par ordinateur et de contrôle moteur via Raspberry Pi. J'ai également acquis de l'expérience en modélisation 3D et en intégration mécanique-électronique, tout en apprenant à communiquer efficacement les résultats techniques de manière claire et accessible. Le travail en binôme a renforcé ma capacité à collaborer, planifier et respecter des contraintes de temps dans un cadre semi-professionnel."
  },
  "robotcrabe": {
    "title": "Robot Crabe Motorisé",
    "subtitle": "Conception d'un robot quadrupède contrôlable via interface web sans fil.",
    "contextTitle": "Contexte",
    "contextText": "Ce projet personnel consistait à concevoir et réaliser un robot crabe motorisé, intégrant à la fois des aspects mécaniques, électroniques et logiciels. L'objectif était de créer une expérience immersive mêlant modélisation 3D, électronique embarquée et connectivité sans fil. L'objectif était de développer un robot capable de mouvements coordonnés des pattes, contrôlables via une interface mobile. Le projet combine la conception mécanique, la programmation embarquée et la connectivité sans fil, offrant une intégration complète de différentes disciplines de l'ingénierie.",
    "figcaption1": "Photo du robot crabe assemblé.",
    "approachTitle": "Démarche",
    "step1": "Modélisation 3D : conception des différentes parties du crabe pour assurer la fonctionnalité et la robustesse mécanique.",
    "step2": "Fabrication : impression des pièces en 3D et préparation des composants électroniques.",
    "step3": "Assemblage : montage mécanique et intégration des servomoteurs et de la carte ESP32.",
    "step4": "Programmation : développement d'une interface web en HTML permettant de contrôler les mouvements des pattes et la caméra embarquée, via une connexion sans fil.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis de développer des compétences transversales en conception mécanique, prototypage 3D, programmation embarquée et développement d'interface utilisateur. J'ai appris à coordonner différents systèmes (mécanique, électronique et logiciel) pour obtenir un dispositif fonctionnel et interactif, tout en explorant la connectivité sans fil pour le contrôle à distance."
  },
  "declencheur": {
    "title": "Déclencheur Photo Argentique",
    "subtitle": "Dispositif de déclenchement à distance pour appareils photo argentiques.",
    "contextTitle": "Contexte",
    "contextText": "Dans le cadre d'un projet pour une entreprise spécialisée dans le développement de photographie argentique, j'ai participé à la conception et à la réalisation d'un déclencheur à distance pour appareils photo argentiques. Le produit devait être pratique, transportable et facilement utilisable par le public.",
    "objectivesTitle": "Objectifs du dispositif",
    "objective1": "Déclencher l'appareil à distance via télécommande.",
    "objective2": "Proposer plusieurs modes de déclenchement (immédiat ou avec retardateur de 5 secondes).",
    "objective3": "Être transportable, alimenté par batterie rechargeable et conçu avec un design sobre.",
    "figcaption1": "Prototype du déclencheur photo argentique.",
    "approachTitle": "Démarche",
    "step1": "Choix des composants : ESP32, servomoteur, BMS, batterie 18650, récepteur 433 MHz et déclencheur mécanique adapté aux appareils argentiques.",
    "step2": "Prototypage et conception : réalisation d'un prototype fonctionnel, intégrant la mécanique, l'électronique et la programmation.",
    "step3": "Boîtier 3D : modélisation et impression en PLA pour assurer robustesse et ergonomie.",
    "step4": "Développement logiciel : programmation de l'ESP32 pour gérer les différents modes de déclenchement et la réception des signaux de télécommande.",
    "step5": "Tests et ajustements : validation de la fiabilité, autonomie et précision du déclenchement.",
    "statusTitle": "État du projet",
    "statusText": "La première version du prototype (V1) est terminée et actuellement en phase de test.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis de développer des compétences en systèmes embarqués, prototypage, électronique et conception mécanique, tout en prenant en compte les contraintes de transportabilité, autonomie et ergonomie utilisateur."
  },
  "decors": {
    "title": "Décors Automatisés de Spectacle",
    "subtitle": "Système automatisé de décors pour production théâtrale avec grue rotative, feux de signalisation et véhicules motorisés.",
    "contextTitle": "Contexte",
    "contextText": "Dans le cadre d'un projet réalisé pour une entreprise de production de spectacles, j'ai participé à la conception et à la réalisation de décors automatisés. Ces décors devaient pouvoir effectuer différentes actions mécaniques (rotation, déplacement, signalisation) de manière autonome, tout en étant facilement contrôlables par un opérateur.",
    "objectivesTitle": "Objectifs du système",
    "objective1": "Faire tourner une grue d'un angle défini, puis revenir à sa position initiale en boucle.",
    "objective2": "Contrôler un feu de signalisation alternant entre rouge et vert toutes les x secondes.",
    "objective3": "Faire avancer des voitures miniatures sur scène.",
    "objective4": "L'ensemble devait être actionné par un simple bouton, fonctionner sur batterie et être fiable pour des répétitions et représentations.",
    "figcaption1": "Décors automatisés pour spectacle.",
    "approachTitle": "Démarche",
    "step1": "Analyse et choix des composants : utilisation d'une Arduino Uno, de 2 drivers de moteur pas à pas, d'un BMS, d'un élévateur de tension, d'un interrupteur, d'un servomoteur et de 2 moteurs pas à pas.",
    "step2": "Prototypage : réalisation de prototypes fonctionnels pour tester la mécanique, les moteurs et la programmation avant la version finale.",
    "step3": "Câblage et soudure : réalisation complète des connexions entre tous les composants électroniques pour assurer un fonctionnement fiable et sécurisé.",
    "step4": "Conception mécanique : modélisation et impression 3D de supports pour moteurs et du boîtier principal, garantissant robustesse et intégration optimale.",
    "step5": "Développement logiciel : programmation des mouvements des moteurs et des feux, avec gestion des cycles en boucle et contrôle via bouton.",
    "step6": "Tests et ajustements : validation des trajectoires, des timings et de l'alimentation sur batterie pour garantir la fiabilité en conditions réelles.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis de développer des compétences complètes en prototypage, systèmes embarqués, programmation Arduino, motorisation et câblage électronique. J'ai également renforcé mes capacités en conception mécanique et intégration de systèmes électromécaniques, tout en respectant les contraintes de fiabilité et d'ergonomie pour un usage scénique."
  },
  "contact": {
    "title": "Contact",
    "subtitle": "Vous pouvez m’envoyer un message via ce formulaire.",
    "firstNameLabel": "Prénom",
    "lastNameLabel": "Nom",
    "emailLabel": "Email",
    "messageLabel": "Message",
    "firstNamePlaceholder": "Ex: Mateo",
    "lastNamePlaceholder": "Ex: Repulles",
    "emailPlaceholder": "Ex: mateo@email.com",
    "messagePlaceholder": "Écris ton message ici...",
    "send": "Envoyer",
    "sending": "Envoi en cours...",
    "success": "Message envoyé ✅",
    "error": "Erreur lors de l'envoi ❌"
  }
}


