{
  "nav": {
    "home": "Accueil",
    "about": "À propos",
    "projects": "Projets",
    "contact": "Contact"
  },
  
    "home": {
    "title": "Salut, moi c'est Mateo 👋",
    "subtitle": "Étudiant ingénieur en systèmes embarqués et IoT basé à Paris. J'écris du firmware, je conçois des PCB et j'imprime mes boîtiers en 3D. Sur ce site, tu trouveras mes projets IoT, mes expériences professionnelles et tout ce qui tourne autour des microcontrôleurs et de l'électronique embarquée. Actuellement en recherche de stage à l'international !",
    "viewProjects": "Voir mes projets",
    "contact": "Me contacter",
    "aboutTitle": "À propos de moi",
    "aboutText": "Passionné par les systèmes embarqués, je combine développement firmware et conception hardware pour créer des solutions IoT complètes. De la validation de drones chez Aerommaper (filiale Thales) aux projets de fabrication additive intégrant l'électronique, j'aime transformer des idées en prototypes fonctionnels.",
    "aboutText2": "Avec une expertise en STM32, ESP32, protocoles de communication (UART, SPI, I2C, MQTT) et systèmes temps réel, je cherche constamment à approfondir mes compétences techniques et à relever de nouveaux défis dans le domaine de l'embarqué.",
    "currentFocus": "Focus actuel",
    "education": "Formation",
    "availability": "Disponibilité",
    "availabilityText": "Ouvert aux stages internationaux",
    "selectedProjects": "Projets sélectionnés",
    "portfolioDesc": "Portfolio Web",
    "dashboardDesc": "Site portfolio moderne développé avec React et Tailwind CSS.",
    "readMore": "En savoir plus →"
  },
  "footer": {
    "quickLinks": "Liens rapides",
    "projects": "Projets",
    "about": "À propos",
    "contact": "Contact",
    "connect": "Me suivre",
    "rights": "Tous droits réservés.",
    "madeWith": "Créé avec"
  },
  "projects": {
    "title": "Mes Projets",
    "portfolioDesc": "Portfolio Website",
    "dashboardDesc": "Interface dashboard moderne avec analytics.",
    "mobileDesc": "Application mobile cross-platform.",
    "aqm": {
      "title": "Boîtier AQM",
      "description": "SMART_IO, une entreprise experte dans les dispositifs IoT, a été désignée par la start-up française NOSE pour concevoir et fabriquer l'AQM (Air Quality Monitoring). Ce projet a impliqué la transition de la phase de prototypage conformément au cahier des charges vers la gestion de la production et des coûts financiers du produit.",
      "button": "Voir le projet"
    }
    
  },
  "about": {
    "title": "À propos de moi",
    "description": "Je suis un développeur passionné par la création d'interfaces modernes et performantes.",
    "skillsTitle": "Compétences",
    "goalTitle": "Objectif",
    "goalText": "Créer des produits digitaux élégants et efficaces."
  },
  "portfolioProject": {
    "title": "Portfolio Personnel",
    "subtitle": "Un site vitrine moderne pour présenter mes projets et compétences.",
    "overviewTitle": "Vue d'ensemble",
    "overviewText": "Ce portfolio a été conçu pour présenter mes projets, mes compétences et mon parcours de manière claire et professionnelle.",
    "challengeTitle": "Challenge",
    "challengeText": "Créer une interface minimaliste, responsive et multilingue tout en gardant de bonnes performances.",
    "resultTitle": "Résultat",
    "resultText": "Un site rapide, moderne et évolutif, prêt à accueillir de nouveaux projets et fonctionnalités."
  },
  "aqm": {
    "title": "Boîtier AQM (Air Quality Monitoring)",
    "subtitle": "Industrialisation d’un dispositif IoT de surveillance de la qualité de l’air.",
    "contextTitle": "Contexte",
    "contextText": "Dans le cadre d’un projet de groupe (4 personnes), nous avons travaillé sur la gestion de production d’un objet connecté pour la start-up française NOSE. L’objectif était de transformer un prototype conforme au cahier des charges en un produit industrialisable.",
    "approachTitle": "Démarche",
    "step1": "Conception et validation du prototype du dispositif.",
    "step2": "Définition du procédé d’assemblage et des étapes de fabrication.",
    "step3": "Réalisation d’un bilan financier complet (coûts matières, production, assemblage).",
    "step4": "Proposition d’améliorations de la ligne de production pour optimiser l’efficacité.",
    "step5": "Rédaction et soutenance d’un dossier final détaillé.",
    "learningTitle": "Compétences développées",
    "figcaption1":"Dessin technique d’une vue éclaté du dispositif, fait sur FUSION 360",
    "learningText": "Ce projet m’a permis d’acquérir une vision globale du cycle de production d’un produit IoT, de la conception à l’industrialisation. J’ai renforcé mes compétences en gestion de production, analyse financière et travail en équipe."
  },
  "asservissement": {
    "title": "Jouet Interactif avec Asservissement",
    "subtitle": "Conception d'un système mécatronique intégrant base tournante et lanceur de billes.",
    "contextTitle": "Contexte",
    "contextText": "Dans le cadre d'un projet scolaire en équipe de quatre, nous avons travaillé sur la conception et le développement d'un jouet interactif. Celui-ci était composé d'une base tournante et d'un lanceur de billes, intégrant à la fois des composants mécaniques, électroniques et un système de commande. L'objectif du projet était de concevoir un dispositif ludique et fonctionnel, en associant l'électronique de puissance et l'asservissement. Le système devait utiliser un moteur à courant continu pour la rotation et un servomoteur pour le tir, le tout piloté par une carte Arduino.",
    "figcaption1": "Schéma du câblage du dispositif.",
    "approachTitle": "Démarche",
    "step1": "Analyse fonctionnelle : élaboration d'un cahier des charges précis définissant les besoins, contraintes et fonctionnalités attendues.",
    "step2": "Prototypage : réalisation d'un prototype intégrant la base tournante et développement progressif des composants (moteur, servomoteur, électroaimant).",
    "step3": "Commande et contrôle : programmation de l'Arduino pour assurer la gestion des mouvements, avec mise en place d'un asservissement PID pour garantir la précision.",
    "step4": "Tests et ajustements : réalisation de séries de tests pour vérifier la fiabilité et ajuster les paramètres, tout en prenant en compte les aspects de sécurité et d'efficacité.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis de mettre en pratique mes connaissances en électronique, programmation embarquée et asservissement. J'ai pu approfondir la compréhension des boucles PID et leur application concrète, tout en travaillant sur l'intégration d'éléments mécaniques et électroniques dans un même système. Cette expérience a renforcé mes compétences en travail collaboratif, prototypage et mise au point de systèmes automatisés."
  },
   "amplification": {
    "title": "Amplificateur Audio Connecté",
    "subtitle": "Conception d'un amplificateur audio avec optimisation énergétique et connectivité IoT SIGFOX.",
    "contextTitle": "Contexte",
    "contextText": "Dans le cadre d'un projet scolaire en équipe de quatre, nous avons travaillé sur la conception et la réalisation d'un amplificateur audio intégrant des fonctionnalités avancées d'optimisation et de connectivité. L'objectif principal était de développer un prototype d'amplificateur alliant efficacité énergétique et gain en puissance, tout en garantissant une robustesse mécanique et une facilité de maintenance. Une particularité de ce projet était d'intégrer une transmission de données via le réseau SIGFOX, permettant de connecter l'appareil à un réseau IoT.",
    "figcaption1": "Schéma d'un push pull avec des transistors.",
    "approachTitle": "Démarche",
    "step1": "Étude préliminaire : analyse des différents types d'amplificateurs (passifs et actifs) afin de déterminer l'architecture la plus adaptée.",
    "step2": "Simulation : conception et validation d'un premier prototype sur logiciel afin d'anticiper le comportement du circuit.",
    "step3": "Réalisation d'un prototype complet : intégration des composants électroniques et mécaniques pour construire un système fonctionnel.",
    "step4": "Démonstration : présentation du prototype final et validation de ses performances en conditions réelles.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis de développer des compétences en électronique analogique et numérique, notamment sur l'amplification et le filtrage du signal. J'ai également acquis une meilleure maîtrise des outils de simulation de circuits électroniques et j'ai pu expérimenter l'intégration d'une solution de connectivité IoT (SIGFOX) dans un système embarqué. Enfin, ce travail en équipe m'a appris à concilier performance technique, robustesse et contraintes de consommation énergétique dans une conception électronique."
  },
  "meteo": {
    "title": "Station Météo Embarquée",
    "subtitle": "Dispositif de surveillance environnementale pour contexte maritime.",
    "contextTitle": "Contexte",
    "contextText": "En équipe de quatre, nous avons mené un projet autour des systèmes embarqués visant à concevoir un dispositif de surveillance environnementale utilisable dans un contexte maritime. L'objectif était de développer une station météo embarquée, à la fois simple d'utilisation pour un membre d'équipage et capable d'assurer des fonctions complètes de mesure, surveillance et enregistrement des données environnementales (température, humidité, pression, etc.).",
    "figcaption1": "Schéma du fonctionnement de la station météo.",
    "approachTitle": "Démarche",
    "step1": "Analyse du système : définition des besoins fonctionnels, contraintes techniques et conditions d'utilisation en milieu embarqué.",
    "step2": "Conception logicielle : élaboration de l'architecture du programme pour organiser la gestion des capteurs, le stockage des données et l'interface utilisateur.",
    "step3": "Prototypage : réalisation d'une maquette fonctionnelle intégrant les capteurs et la partie traitement embarqué.",
    "step4": "Documentation : rédaction d'un dossier technique complet détaillant la conception, l'architecture logicielle et matérielle, ainsi que les choix technologiques retenus.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis d'approfondir mes compétences en systèmes embarqués, notamment dans la gestion de capteurs et d'acquisitions de données. J'ai également appris à structurer un projet autour d'une architecture logicielle claire et à produire une documentation technique complète, indispensable pour la reproductibilité et la maintenance. Ce travail collaboratif a renforcé ma capacité à relier exigences utilisateur, contraintes techniques et réalisation concrète."
  },
  "tourelle": {
    "title": "Tourelle de Reconnaissance Faciale",
    "subtitle": "Système motorisé intégrant vision par ordinateur et reconnaissance faciale sur Raspberry Pi.",
    "contextTitle": "Contexte",
    "contextText": "Dans le cadre de mon stage, réalisé en binôme, nous avons travaillé sur le développement d'une tourelle motorisée intégrant un système de reconnaissance faciale. Ce projet combinait électronique, mécanique, vision par ordinateur et communication technique. L'objectif principal était de concevoir une tourelle imposante et fonctionnelle, reposant sur un Raspberry Pi et un développement en Python, tout en assurant une simplicité d'utilisation. Le projet devait également être pédagogique et accessible à un large public, grâce à une communication régulière via des vidéos hebdomadaires démontrant l'avancement, sans compromettre la qualité visuelle ni la clarté technique.",
    "figcaption1": "Capture d'écran du retour vidéo de la reconnaissance faciale.",
    "figcaption2": "CAO du système de tir.",
    "approachTitle": "Démarche",
    "step1": "Analyse des besoins : identification des contraintes techniques, mécaniques et logicielles pour assurer robustesse et simplicité.",
    "step2": "Conception du système : définition de l'architecture (liaison entre Raspberry Pi, moteurs et caméra).",
    "step3": "Modélisation 3D : conception des pièces mécaniques nécessaires au support et au mouvement de la tourelle.",
    "step4": "Fabrication : impression 3D et assemblage des différents composants mécaniques et électroniques.",
    "step5": "Développement logiciel : programmation en Python pour la gestion des moteurs et l'implémentation de la reconnaissance faciale.",
    "step6": "Tests et validation : évaluation des performances, ajustements et démonstrations publiques du fonctionnement.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis de développer des compétences concrètes en programmation Python, en particulier sur les aspects de vision par ordinateur et de contrôle moteur via Raspberry Pi. J'ai également acquis de l'expérience en modélisation 3D et en intégration mécanique-électronique, tout en apprenant à communiquer efficacement les résultats techniques de manière claire et accessible. Le travail en binôme a renforcé ma capacité à collaborer, planifier et respecter des contraintes de temps dans un cadre semi-professionnel."
  },
  "robotcrabe": {
    "title": "Robot Crabe Motorisé",
    "subtitle": "Conception d'un robot quadrupède contrôlable via interface web sans fil.",
    "contextTitle": "Contexte",
    "contextText": "Ce projet personnel consistait à concevoir et réaliser un robot crabe motorisé, intégrant à la fois des aspects mécaniques, électroniques et logiciels. L'objectif était de créer une expérience immersive mêlant modélisation 3D, électronique embarquée et connectivité sans fil. L'objectif était de développer un robot capable de mouvements coordonnés des pattes, contrôlables via une interface mobile. Le projet combine la conception mécanique, la programmation embarquée et la connectivité sans fil, offrant une intégration complète de différentes disciplines de l'ingénierie.",
    "figcaption1": "Photo du robot crabe assemblé.",
    "approachTitle": "Démarche",
    "step1": "Modélisation 3D : conception des différentes parties du crabe pour assurer la fonctionnalité et la robustesse mécanique.",
    "step2": "Fabrication : impression des pièces en 3D et préparation des composants électroniques.",
    "step3": "Assemblage : montage mécanique et intégration des servomoteurs et de la carte ESP32.",
    "step4": "Programmation : développement d'une interface web en HTML permettant de contrôler les mouvements des pattes et la caméra embarquée, via une connexion sans fil.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis de développer des compétences transversales en conception mécanique, prototypage 3D, programmation embarquée et développement d'interface utilisateur. J'ai appris à coordonner différents systèmes (mécanique, électronique et logiciel) pour obtenir un dispositif fonctionnel et interactif, tout en explorant la connectivité sans fil pour le contrôle à distance."
  },
  "declencheur": {
    "title": "Déclencheur Photo Argentique",
    "subtitle": "Dispositif de déclenchement à distance pour appareils photo argentiques.",
    "contextTitle": "Contexte",
    "contextText": "Dans le cadre d'un projet pour une entreprise spécialisée dans le développement de photographie argentique, j'ai participé à la conception et à la réalisation d'un déclencheur à distance pour appareils photo argentiques. Le produit devait être pratique, transportable et facilement utilisable par le public.",
    "objectivesTitle": "Objectifs du dispositif",
    "objective1": "Déclencher l'appareil à distance via télécommande.",
    "objective2": "Proposer plusieurs modes de déclenchement (immédiat ou avec retardateur de 5 secondes).",
    "objective3": "Être transportable, alimenté par batterie rechargeable et conçu avec un design sobre.",
    "figcaption1": "Prototype du déclencheur photo argentique.",
    "approachTitle": "Démarche",
    "step1": "Choix des composants : ESP32, servomoteur, BMS, batterie 18650, récepteur 433 MHz et déclencheur mécanique adapté aux appareils argentiques.",
    "step2": "Prototypage et conception : réalisation d'un prototype fonctionnel, intégrant la mécanique, l'électronique et la programmation.",
    "step3": "Boîtier 3D : modélisation et impression en PLA pour assurer robustesse et ergonomie.",
    "step4": "Développement logiciel : programmation de l'ESP32 pour gérer les différents modes de déclenchement et la réception des signaux de télécommande.",
    "step5": "Tests et ajustements : validation de la fiabilité, autonomie et précision du déclenchement.",
    "statusTitle": "État du projet",
    "statusText": "La première version du prototype (V1) est terminée et actuellement en phase de test.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis de développer des compétences en systèmes embarqués, prototypage, électronique et conception mécanique, tout en prenant en compte les contraintes de transportabilité, autonomie et ergonomie utilisateur."
  },
  "decors": {
    "title": "Décors Automatisés de Spectacle",
    "subtitle": "Système automatisé de décors pour production théâtrale avec grue rotative, feux de signalisation et véhicules motorisés.",
    "contextTitle": "Contexte",
    "contextText": "Dans le cadre d'un projet réalisé pour une entreprise de production de spectacles, j'ai participé à la conception et à la réalisation de décors automatisés. Ces décors devaient pouvoir effectuer différentes actions mécaniques (rotation, déplacement, signalisation) de manière autonome, tout en étant facilement contrôlables par un opérateur.",
    "objectivesTitle": "Objectifs du système",
    "objective1": "Faire tourner une grue d'un angle défini, puis revenir à sa position initiale en boucle.",
    "objective2": "Contrôler un feu de signalisation alternant entre rouge et vert toutes les x secondes.",
    "objective3": "Faire avancer des voitures miniatures sur scène.",
    "objective4": "L'ensemble devait être actionné par un simple bouton, fonctionner sur batterie et être fiable pour des répétitions et représentations.",
    "figcaption1": "Décors automatisés pour spectacle.",
    "approachTitle": "Démarche",
    "step1": "Analyse et choix des composants : utilisation d'une Arduino Uno, de 2 drivers de moteur pas à pas, d'un BMS, d'un élévateur de tension, d'un interrupteur, d'un servomoteur et de 2 moteurs pas à pas.",
    "step2": "Prototypage : réalisation de prototypes fonctionnels pour tester la mécanique, les moteurs et la programmation avant la version finale.",
    "step3": "Câblage et soudure : réalisation complète des connexions entre tous les composants électroniques pour assurer un fonctionnement fiable et sécurisé.",
    "step4": "Conception mécanique : modélisation et impression 3D de supports pour moteurs et du boîtier principal, garantissant robustesse et intégration optimale.",
    "step5": "Développement logiciel : programmation des mouvements des moteurs et des feux, avec gestion des cycles en boucle et contrôle via bouton.",
    "step6": "Tests et ajustements : validation des trajectoires, des timings et de l'alimentation sur batterie pour garantir la fiabilité en conditions réelles.",
    "learningTitle": "Compétences développées",
    "learningText": "Ce projet m'a permis de développer des compétences complètes en prototypage, systèmes embarqués, programmation Arduino, motorisation et câblage électronique. J'ai également renforcé mes capacités en conception mécanique et intégration de systèmes électromécaniques, tout en respectant les contraintes de fiabilité et d'ergonomie pour un usage scénique."
  },
  "contact": {
    "title": "Contact",
    "subtitle": "Tu peux m’envoyer un message via ce formulaire.",
    "firstNameLabel": "Prénom",
    "lastNameLabel": "Nom",
    "emailLabel": "Email",
    "messageLabel": "Message",
    "firstNamePlaceholder": "Ex: Mateo",
    "lastNamePlaceholder": "Ex: Repulles",
    "emailPlaceholder": "Ex: mateo@email.com",
    "messagePlaceholder": "Écris ton message ici...",
    "send": "Envoyer",
    "sending": "Envoi en cours...",
    "success": "Message envoyé ✅",
    "error": "Erreur lors de l'envoi ❌"
  }
}


